Revit 2027 API
BuiltInFailures.CutFailures.CannotCutRoof Property
 The roof couldn't be cut.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutRoof { get; }
Public Shared ReadOnly Property CannotCutRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutRoof {
	FailureDefinitionId^ get ();
}
static member CannotCutRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace